# File Info

- A hodgepodge of data exploration, one-off file processing (converting spider .sql files to .db files for LangChain), and whatever else I needed a disorganized notebook for

In [3]:
from datasets import load_dataset
import pandas as pd
import os
from langchain_community.utilities.sql_database import SQLDatabase

/Users/mymac/opt/anaconda3/envs/LLM/lib/python3.9/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

### Loading Data

In [4]:
dataset = load_dataset("xlangai/spider")

In [29]:
dataset['validation']

Dataset({
    features: ['db_id', 'query', 'question', 'query_toks', 'query_toks_no_value', 'question_toks'],
    num_rows: 1034
})

In [3]:
dataset['train']

Dataset({
    features: ['db_id', 'query', 'question', 'query_toks', 'query_toks_no_value', 'question_toks'],
    num_rows: 7000
})

In [4]:
dataset

DatasetDict({
    train: Dataset({
        features: ['db_id', 'query', 'question', 'query_toks', 'query_toks_no_value', 'question_toks'],
        num_rows: 7000
    })
    validation: Dataset({
        features: ['db_id', 'query', 'question', 'query_toks', 'query_toks_no_value', 'question_toks'],
        num_rows: 1034
    })
})

In [14]:
df_train = dataset['train'].to_pandas()

df_test = dataset['validation'].to_pandas()

In [25]:
df_test['db_id'].unique()
result = df_test[df_test['db_id'] == 'car_1']
x = result['question']

In [28]:
x.to_list()

['How many continents are there?',
 'What is the number of continents?',
 'How many countries does each continent have? List the continent id, continent name and the number of countries.',
 'For each continent, list its id, name, and how many countries it has?',
 'How many countries are listed?',
 'How many countries exist?',
 'How many models does each car maker produce? List maker full name, id and the number.',
 'What is the full name of each car maker, along with its id and how many models it produces?',
 'Which model of the car has the minimum horsepower?',
 'What is the model of the car with the smallest amount of horsepower?',
 'Find the model of the car whose weight is below the average weight.',
 'What is the model for the car with a weight smaller than the average?',
 'Find the name of the makers that produced some cars in the year of 1970?',
 'What is the name of the different car makers who produced a car in 1970?',
 'Find the make and production time of the cars that were produced in the earliest year?',
 'What is the maker of the carr produced in the earliest year and what year was it?',
 'Which distinct car models are the produced after 1980?',
 'What are the different models for the cards produced after 1980?',
 'How many car makers are there in each continents? List the continent name and the count.',
 'What is the name of each continent and how many car makers are there in each one?',
 'Which of the countries has the most car makers? List the country name.',
 'What is the name of the country with the most car makers?',
 'How many car models are produced by each maker ? Only list the count and the maker full name .',
 'What is the number of car models that are produced by each maker and what is the id and full name of each maker?',
 'What is the accelerate of the car make amc hornet sportabout (sw)?',
 'How much does the car accelerate that makes amc hornet sportabout (sw)?',
 'How many car makers are there in france?',
 'What is the number of makers of care in France?',
 'How many car models are produced in the usa?',
 'What is the count of the car models produced in the United States?',
 'What is the average miles per gallon(mpg) of the cars with 4 cylinders?',
 'What is the average miles per gallon of all the cards with 4 cylinders?',
 'What is the smallest weight of the car produced with 8 cylinders on 1974 ?',
 'What is the minimum weight of the car with 8 cylinders produced in 1974 ?',
 'What are all the makers and models?',
 'What are the makers and models?',
 'What are the countries having at least one car maker? List name and id.',
 'What are the names and ids of all countries with at least one car maker?',
 'What is the number of the cars with horsepower more than 150?',
 'What is the number of cars with a horsepower greater than 150?',
 'What is the average weight of cars each year?',
 'What is the average weight and year for each year?',
 'Which countries in europe have at least 3 car manufacturers?',
 'What are the names of all European countries with at least 3 manufacturers?',
 'What is the maximum horsepower and the make of the car models with 3 cylinders?',
 'What is the largest amount of horsepower for the models with 3 cylinders and what make is it?',
 'Which model saves the most gasoline? That is to say, have the maximum miles per gallon.',
 'What is the car model with the highest mpg ?',
 'What is the average horsepower of the cars before 1980?',
 'What is the average horsepower for all cars produced before 1980 ?',
 'What is the average edispl of the cars of model volvo?',
 'What is the average edispl for all volvos?',
 'What is the maximum accelerate for different number of cylinders?',
 'What is the maximum accelerate for all the different cylinders?',
 'Which model has the most version(make) of cars?',
 'What model has the most different versions?',
 'How many cars have more than 4 cylinders?',
 'What is the number of cars with more than 4 cylinders?',
 'how many cars were produced in 1980?',
 'In 1980, how many cars were made?',
 'How many car models were produced by the maker with full name American Motor Company?',
 'What is the number of car models created by the car maker American Motor Company?',
 'Which makers designed more than 3 car models? List full name and the id.',
 'What are the names and ids of all makers with more than 3 models?',
 'Which distinctive models are produced by maker with the full name General Motors or weighing more than 3500?',
 'What are the different models created by either the car maker General Motors or weighed more than 3500?',
 'In which years cars were produced weighing no less than 3000 and no more than 4000 ?',
 'What are the different years in which there were cars produced that weighed less than 4000 and also cars that weighted more than 3000 ?',
 'What is the horsepower of the car with the largest accelerate?',
 'What is the horsepower of the car with the greatest accelerate?',
 'For model volvo, how many cylinders does the car with the least accelerate have?',
 'For a volvo model, how many cylinders does the version with least accelerate have?',
 'How many cars have a larger accelerate than the car with the largest horsepower?',
 'What is the number of cars with a greater accelerate than the one with the most horsepower?',
 'How many countries has more than 2 car makers ?',
 'What is the number of countries with more than 2 car makers ?',
 'How many cars has over 6 cylinders?',
 'What is the number of carsw ith over 6 cylinders?',
 'For the cars with 4 cylinders, which model has the largest horsepower?',
 'For all of the 4 cylinder cars, which model has the most horsepower?',
 'Among the cars with more than lowest horsepower, which ones do not have more than 3 cylinders? List the car makeid and make name.',
 'Among the cars that do not have the minimum horsepower , what are the make ids and names of all those with less than 4 cylinders ?',
 'What is the maximum miles per gallon of the car with 8 cylinders or produced before 1980 ?',
 'What is the maximum mpg of the cars that had 8 cylinders or that were produced before 1980 ?',
 "Which models are lighter than 3500 but not built by the 'Ford Motor Company'?",
 'What are the different models wthat are lighter than 3500 but were not built by the Ford Motor Company?',
 'What are the name of the countries where there is not a single car maker?',
 'What are the names of the countries with no car makers?',
 'Which are the car makers which produce at least 2 models and more than 3 car makers ? List the id and the maker .',
 'What are the ids and makers of all car makers that produce at least 2 models and make more than 3 cars?',
 "What are the id and names of the countries which have more than 3 car makers or produce the 'fiat' model?",
 'What are the ids and names of all countries that either have more than 3 car makers or produce fiat model ?']

In [20]:
car_Qs = []
for idx, row in df_train.iterrows():
    if row['db_id'] == 'country_language':
        car_Qs.append(row['question'])

In [21]:
car_Qs

[]

In [6]:
result = df_train.loc[df_train['db_id'].str.contains('chinook', na=False)]
result

,db_id,query,question,query_toks,query_toks_no_value,question_toks
807,chinook_1,SELECT count(*) FROM ALBUM,How many albums are there?,"[SELECT, count, (, *, ), FROM, ALBUM]","[select, count, (, *, ), from, album]","[How, many, albums, are, there, ?]"
808,chinook_1,SELECT count(*) FROM ALBUM,Find the number of albums.,"[SELECT, count, (, *, ), FROM, ALBUM]","[select, count, (, *, ), from, album]","[Find, the, number, of, albums, .]"
809,chinook_1,SELECT Name FROM GENRE,List the names of all music genres.,"[SELECT, Name, FROM, GENRE]","[select, name, from, genre]","[List, the, names, of, all, music, genres, .]"
810,chinook_1,SELECT Name FROM GENRE,What are the names of different music genres?,"[SELECT, Name, FROM, GENRE]","[select, name, from, genre]","[What, are, the, names, of, different, music, ..."
811,chinook_1,"SELECT * FROM CUSTOMER WHERE State = ""NY""",Find all the customer information in state NY.,"[SELECT, *, FROM, CUSTOMER, WHERE, State, =, `...","[select, *, from, customer, where, state, =, v...","[Find, all, the, customer, information, in, st..."
...,...,...,...,...,...,...
886,chinook_1,SELECT distinct(UnitPrice) FROM TRACK,Find the distinct unit prices for tracks.,"[SELECT, distinct, (, UnitPrice, ), FROM, TRACK]","[select, distinct, (, unitprice, ), from, track]","[Find, the, distinct, unit, prices, for, track..."
887,chinook_1,SELECT count(*) FROM ARTIST WHERE artistid NOT...,How many artists do not have any album?,"[SELECT, count, (, *, ), FROM, ARTIST, WHERE, ...","[select, count, (, *, ), from, artist, where, ...","[How, many, artists, do, not, have, any, album..."
888,chinook_1,SELECT count(*) FROM ARTIST WHERE artistid NOT...,Cound the number of artists who have not relea...,"[SELECT, count, (, *, ), FROM, ARTIST, WHERE, ...","[select, count, (, *, ), from, artist, where, ...","[Cound, the, number, of, artists, who, have, n..."
889,chinook_1,SELECT T1.Title FROM Album AS T1 JOIN Track AS...,What are the album titles for albums containin...,"[SELECT, T1.Title, FROM, Album, AS, T1, JOIN, ...","[select, t1, ., title, from, album, as, t1, jo...","[What, are, the, album, titles, for, albums, c..."
890,chinook_1,SELECT T1.Title FROM Album AS T1 JOIN Track AS...,Find the titles of albums that contain tracks ...,"[SELECT, T1.Title, FROM, Album, AS, T1, JOIN, ...","[select, t1, ., title, from, album, as, t1, jo...","[Find, the, titles, of, albums, that, contain,..."

In [7]:
X_test_query_chinook = result['question']
y_test_query_chinook = []

for index, row in result['query'].iloc[0:100].iteritems():
    y_test_query_chinook.append((row, result['db_id'][index]))

In [8]:
y_test_query_chinook

[('SELECT count(*) FROM ALBUM', 'chinook_1'),
 ('SELECT count(*) FROM ALBUM', 'chinook_1'),
 ('SELECT Name FROM GENRE', 'chinook_1'),
 ('SELECT Name FROM GENRE', 'chinook_1'),
 ('SELECT * FROM CUSTOMER WHERE State  =  "NY"', 'chinook_1'),
 ('SELECT * FROM CUSTOMER WHERE State  =  "NY"', 'chinook_1'),
 ('SELECT FirstName ,  LastName FROM EMPLOYEE WHERE City  =  "Calgary"',
  'chinook_1'),
 ('SELECT FirstName ,  LastName FROM EMPLOYEE WHERE City  =  "Calgary"',
  'chinook_1'),
 ('SELECT distinct(BillingCountry) FROM INVOICE', 'chinook_1'),
 ('SELECT distinct(BillingCountry) FROM INVOICE', 'chinook_1'),
 ('SELECT Name FROM ARTIST WHERE Name LIKE "%a%"', 'chinook_1'),
 ('SELECT Name FROM ARTIST WHERE Name LIKE "%a%"', 'chinook_1'),
 ('SELECT Title FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T2.Name  =  "AC/DC"',
  'chinook_1'),
 ('SELECT Title FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T2.Name  =  "AC/DC"',
  'chinook_1'),
 ('SELECT COUNT(*) FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T2.Name  =  "Metallica"',
  'chinook_1'),
 ('SELECT COUNT(*) FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T2.Name  =  "Metallica"',
  'chinook_1'),
 ('SELECT T2.Name FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T1.Title  =  "Balls to the Wall"',
  'chinook_1'),
 ('SELECT T2.Name FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T1.Title  =  "Balls to the Wall"',
  'chinook_1'),
 ('SELECT T2.Name FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId GROUP BY T2.Name ORDER BY COUNT(*) DESC LIMIT 1',
  'chinook_1'),
 ('SELECT T2.Name FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId GROUP BY T2.Name ORDER BY COUNT(*) DESC LIMIT 1',
  'chinook_1'),
 ("SELECT Name FROM TRACK WHERE Name LIKE '%you%'", 'chinook_1'),
 ("SELECT Name FROM TRACK WHERE Name LIKE '%you%'", 'chinook_1'),
 ('SELECT AVG(UnitPrice) FROM TRACK', 'chinook_1'),
 ('SELECT AVG(UnitPrice) FROM TRACK', 'chinook_1'),
 ('SELECT max(Milliseconds) ,  min(Milliseconds) FROM TRACK', 'chinook_1'),
 ('SELECT max(Milliseconds) ,  min(Milliseconds) FROM TRACK', 'chinook_1'),
 ('SELECT T1.Title ,  T2.AlbumID ,  COUNT(*) FROM ALBUM AS T1 JOIN TRACK AS T2 ON T1.AlbumId  =  T2.AlbumId GROUP BY T2.AlbumID',
  'chinook_1'),
 ('SELECT T1.Title ,  T2.AlbumID ,  COUNT(*) FROM ALBUM AS T1 JOIN TRACK AS T2 ON T1.AlbumId  =  T2.AlbumId GROUP BY T2.AlbumID',
  'chinook_1'),
 ('SELECT T1.Name FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId GROUP BY T2.GenreId ORDER BY COUNT(*) DESC LIMIT 1',
  'chinook_1'),
 ('SELECT T1.Name FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId GROUP BY T2.GenreId ORDER BY COUNT(*) DESC LIMIT 1',
  'chinook_1'),
 ('SELECT T1.Name FROM MEDIATYPE AS T1 JOIN TRACK AS T2 ON T1.MediaTypeId  =  T2.MediaTypeId GROUP BY T2.MediaTypeId ORDER BY COUNT(*) ASC LIMIT 1',
  'chinook_1'),
 ('SELECT T1.Name FROM MEDIATYPE AS T1 JOIN TRACK AS T2 ON T1.MediaTypeId  =  T2.MediaTypeId GROUP BY T2.MediaTypeId ORDER BY COUNT(*) ASC LIMIT 1',
  'chinook_1'),
 ('SELECT T1.Title ,  T2.AlbumID FROM ALBUM AS T1 JOIN TRACK AS T2 ON T1.AlbumId  =  T2.AlbumId WHERE T2.UnitPrice  >  1 GROUP BY T2.AlbumID',
  'chinook_1'),
 ('SELECT T1.Title ,  T2.AlbumID FROM ALBUM AS T1 JOIN TRACK AS T2 ON T1.AlbumId  =  T2.AlbumId WHERE T2.UnitPrice  >  1 GROUP BY T2.AlbumID',
  'chinook_1'),
 ('SELECT COUNT(*) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Rock"',
  'chinook_1'),
 ('SELECT COUNT(*) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Rock"',
  'chinook_1'),
 ('SELECT AVG(UnitPrice) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Jazz"',
  'chinook_1'),
 ('SELECT AVG(UnitPrice) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Jazz"',
  'chinook_1'),
 ('SELECT FirstName ,  LastName FROM CUSTOMER WHERE Email  =  "luisg@embraer.com.br"',
  'chinook_1'),
 ('SELECT FirstName ,  LastName FROM CUSTOMER WHERE Email  =  "luisg@embraer.com.br"',
  'chinook_1'),
 ('SELECT COUNT(*) FROM CUSTOMER WHERE Email LIKE "%gmail.com%"', 'chinook_1'),
 ('SELECT COUNT(*) FROM CUSTOMER WHERE Email LIKE "%gmail.com%"', 'chinook_1'),
 ('SELECT T2.FirstName ,  T2.LastName FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId WHERE T1.FirstName  =  "Leonie"',
  'chinook_1'),
 ('SELECT T2.FirstName ,  T2.LastName FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId WHERE T1.FirstName  =  "Leonie"',
  'chinook_1'),
 ('SELECT T2.City FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId WHERE T1.PostalCode  =  "70174"',
  'chinook_1'),
 ('SELECT T2.City FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId WHERE T1.PostalCode  =  "70174"',
  'chinook_1'),
 ('SELECT COUNT(DISTINCT city) FROM EMPLOYEE', 'chinook_1'),
 ('SELECT COUNT(DISTINCT city) FROM EMPLOYEE', 'chinook_1'),
 ('SELECT T2.InvoiceDate FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.FirstName  =  "Astrid" AND LastName  =  "Gruber"',
  'chinook_1'),
 ('SELECT T2.InvoiceDate FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.FirstName  =  "Astrid" AND LastName  =  "Gruber"',
  'chinook_1'),
 ('SELECT LastName FROM CUSTOMER EXCEPT SELECT T1.LastName FROM CUSTOMER AS T1 JOIN Invoice AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T2.total  >  20',
  'chinook_1'),
 ('SELECT LastName FROM CUSTOMER EXCEPT SELECT T1.LastName FROM CUSTOMER AS T1 JOIN Invoice AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T2.total  >  20',
  'chinook_1'),
 ('SELECT DISTINCT T1.FirstName FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Brazil"',
  'chinook_1'),
 ('SELECT DISTINCT T1.FirstName FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Brazil"',
  'chinook_1'),
 ('SELECT DISTINCT T1.Address FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Germany"',
  'chinook_1'),
 ('SELECT DISTINCT T1.Address FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Germany"',
  'chinook_1'),
 ('SELECT Phone FROM EMPLOYEE', 'chinook_1'),
 ('SELECT Phone FROM EMPLOYEE', 'chinook_1'),
 ('SELECT COUNT(*) FROM MEDIATYPE AS T1 JOIN TRACK AS T2 ON T1.MediaTypeId  =  T2.MediaTypeId WHERE T1.Name  =  "AAC audio file"',
  'chinook_1'),
 ('SELECT COUNT(*) FROM MEDIATYPE AS T1 JOIN TRACK AS T2 ON T1.MediaTypeId  =  T2.MediaTypeId WHERE T1.Name  =  "AAC audio file"',
  'chinook_1'),
 ('SELECT AVG(Milliseconds) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Latin" OR T1.Name  =  "Pop"',
  'chinook_1'),
 ('SELECT AVG(Milliseconds) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Latin" OR T1.Name  =  "Pop"',
  'chinook_1'),
 ('SELECT T1.FirstName ,  T1.SupportRepId FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId GROUP BY T1.SupportRepId HAVING COUNT(*)  >=  10',
  'chinook_1'),
 ('SELECT T1.FirstName ,  T1.SupportRepId FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId GROUP BY T1.SupportRepId HAVING COUNT(*)  >=  10',
  'chinook_1'),
 ('SELECT T1.LastName FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId GROUP BY T1.SupportRepId HAVING COUNT(*)  <=  20',
  'chinook_1'),
 ('SELECT T1.LastName FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId GROUP BY T1.SupportRepId HAVING COUNT(*)  <=  20',
  'chinook_1'),
 ('SELECT Title FROM ALBUM ORDER BY Title', 'chinook_1'),
 ('SELECT Title FROM ALBUM ORDER BY Title', 'chinook_1'),
 ('SELECT T2.Name ,  T1.ArtistId FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistID GROUP BY T1.ArtistId HAVING COUNT(*)  >=  3 ORDER BY T2.Name',
  'chinook_1'),
 ('SELECT T2.Name ,  T1.ArtistId FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistID GROUP BY T1.ArtistId HAVING COUNT(*)  >=  3 ORDER BY T2.Name',
  'chinook_1'),
 ('SELECT Name FROM ARTIST EXCEPT SELECT T2.Name FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId',
  'chinook_1'),
 ('SELECT Name FROM ARTIST EXCEPT SELECT T2.Name FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId',
  'chinook_1'),
 ('SELECT AVG(T2.UnitPrice) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Rock"',
  'chinook_1'),
 ('SELECT AVG(T2.UnitPrice) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Rock"',
  'chinook_1'),
 ('SELECT max(Milliseconds) ,  min(Milliseconds) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Pop"',
  'chinook_1'),
 ('SELECT max(Milliseconds) ,  min(Milliseconds) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Pop"',
  'chinook_1'),
 ('SELECT BirthDate FROM EMPLOYEE WHERE City  =  "Edmonton"', 'chinook_1'),
 ('SELECT BirthDate FROM EMPLOYEE WHERE City  =  "Edmonton"', 'chinook_1'),
 ('SELECT distinct(UnitPrice) FROM TRACK', 'chinook_1'),
 ('SELECT distinct(UnitPrice) FROM TRACK', 'chinook_1'),
 ('SELECT count(*) FROM ARTIST WHERE artistid NOT IN(SELECT artistid FROM ALBUM)',
  'chinook_1'),
 ('SELECT count(*) FROM ARTIST WHERE artistid NOT IN(SELECT artistid FROM ALBUM)',
  'chinook_1'),
 ("SELECT T1.Title FROM Album AS T1 JOIN Track AS T2 ON T1.AlbumId  =  T2.AlbumId JOIN Genre AS T3 ON T2.GenreID  =  T3.GenreID WHERE T3.Name  =  'Reggae' INTERSECT SELECT T1.Title FROM Album AS T1 JOIN Track AS T2 ON T1.AlbumId  =  T2.AlbumId JOIN Genre AS T3 ON T2.GenreID  =  T3.GenreID WHERE T3.Name  =  'Rock'",
  'chinook_1'),
 ("SELECT T1.Title FROM Album AS T1 JOIN Track AS T2 ON T1.AlbumId  =  T2.AlbumId JOIN Genre AS T3 ON T2.GenreID  =  T3.GenreID WHERE T3.Name  =  'Reggae' INTERSECT SELECT T1.Title FROM Album AS T1 JOIN Track AS T2 ON T1.AlbumId  =  T2.AlbumId JOIN Genre AS T3 ON T2.GenreID  =  T3.GenreID WHERE T3.Name  =  'Rock'",
  'chinook_1')]

In [9]:
X_test_query_chinook

807                           How many albums are there?
808                           Find the number of albums.
809                  List the names of all music genres.
810        What are the names of different music genres?
811       Find all the customer information in state NY.
                             ...
886            Find the distinct unit prices for tracks.
887              How many artists do not have any album?
888    Cound the number of artists who have not relea...
889    What are the album titles for albums containin...
890    Find the titles of albums that contain tracks ...
Name: question, Length: 84, dtype: object

### 100 ROWS

In [10]:
X_test_query = (df_test['question'][0:100],df_test['db_id'])
y_test_query = (df_test['query'][0:100], df_test['db_id'])

In [11]:
X_test_query = []
y_test_query = []

for index, row in df_test['question'].iloc[0:100].iteritems():
    X_test_query.append(row)

for index, row in df_test['query'].iloc[0:100].iteritems():
    y_test_query.append((row, df_test['db_id'][index]))

In [12]:
y_test_query

[('SELECT count(*) FROM singer', 'concert_singer'),
 ('SELECT count(*) FROM singer', 'concert_singer'),
 ('SELECT name ,  country ,  age FROM singer ORDER BY age DESC',
  'concert_singer'),
 ('SELECT name ,  country ,  age FROM singer ORDER BY age DESC',
  'concert_singer'),
 ("SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'",
  'concert_singer'),
 ("SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'",
  'concert_singer'),
 ('SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1',
  'concert_singer'),
 ('SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1',
  'concert_singer'),
 ('SELECT DISTINCT country FROM singer WHERE age  >  20', 'concert_singer'),
 ('SELECT DISTINCT country FROM singer WHERE age  >  20', 'concert_singer'),
 ('SELECT country ,  count(*) FROM singer GROUP BY country', 'concert_singer'),
 ('SELECT country ,  count(*) FROM singer GROUP BY country', 'concert_singer'),
 ('SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)',
  'concert_singer'),
 ('SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)',
  'concert_singer'),
 ('SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000',
  'concert_singer'),
 ('SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000',
  'concert_singer'),
 ('select max(capacity), average from stadium', 'concert_singer'),
 ('select avg(capacity) ,  max(capacity) from stadium', 'concert_singer'),
 ('SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1',
  'concert_singer'),
 ('SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1',
  'concert_singer'),
 ('SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015',
  'concert_singer'),
 ('SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015',
  'concert_singer'),
 ('SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id',
  'concert_singer'),
 ('SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id',
  'concert_singer'),
 ('SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1',
  'concert_singer'),
 ('select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1',
  'concert_singer'),
 ('SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1',
  'concert_singer'),
 ('SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1',
  'concert_singer'),
 ('SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)',
  'concert_singer'),
 ('SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)',
  'concert_singer'),
 ('SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30',
  'concert_singer'),
 ('SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014',
  'concert_singer'),
 ('SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014',
  'concert_singer'),
 ('SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id',
  'concert_singer'),
 ('select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id',
  'concert_singer'),
 ('SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id',
  'concert_singer'),
 ('SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id',
  'concert_singer'),
 ('SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014',
  'concert_singer'),
 ('SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014',
  'concert_singer'),
 ("SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'",
  'concert_singer'),
 ("SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'",
  'concert_singer'),
 ('SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015',
  'concert_singer'),
 ('SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015',
  'concert_singer'),
 ('select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)',
  'concert_singer'),
 ('select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)',
  'concert_singer'),
 ('SELECT count(*) FROM pets WHERE weight  >  10', 'pets_1'),
 ('SELECT count(*) FROM pets WHERE weight  >  10', 'pets_1'),
 ('SELECT weight FROM pets ORDER BY pet_age LIMIT 1', 'pets_1'),
 ('SELECT weight FROM pets ORDER BY pet_age LIMIT 1', 'pets_1'),
 ('SELECT max(weight) ,  petType FROM pets GROUP BY petType', 'pets_1'),
 ('SELECT max(weight) ,  petType FROM pets GROUP BY petType', 'pets_1'),
 ('SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20',
  'pets_1'),
 ('SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20',
  'pets_1'),
 ("SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'",
  'pets_1'),
 ("SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'",
  'pets_1'),
 ('SELECT count(DISTINCT pettype) FROM pets', 'pets_1'),
 ('SELECT count(DISTINCT pettype) FROM pets', 'pets_1'),
 ("SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'",
  'pets_1'),
 ("SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'",
  'pets_1'),
 ("select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'",
  'pets_1'),
 ("SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'",
  'pets_1'),
 ("SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')",
  'pets_1'),
 ("SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')",
  'pets_1'),
 ("SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'",
  'pets_1'),
 ("SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'",
  'pets_1'),
 ("SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')",
  'pets_1'),
 ("SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')",
  'pets_1'),
 ('SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1', 'pets_1'),
 ('SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1', 'pets_1'),
 ('SELECT petid ,  weight FROM pets WHERE pet_age  >  1', 'pets_1'),
 ('SELECT petid ,  weight FROM pets WHERE pet_age  >  1', 'pets_1'),
 ('SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype',
  'pets_1'),
 ('SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype',
  'pets_1'),
 ('SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype', 'pets_1'),
 ('SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype', 'pets_1'),
 ('SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid',
  'pets_1'),
 ('SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid',
  'pets_1'),
 ("SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'",
  'pets_1'),
 ("SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'",
  'pets_1'),
 ('SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid',
  'pets_1'),
 ('select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid',
  'pets_1'),
 ('SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1',
  'pets_1'),
 ('SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1',
  'pets_1'),
 ("SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'",
  'pets_1'),
 ("SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'",
  'pets_1'),
 ('select avg(age) from student where stuid not in (select stuid from has_pet)',
  'pets_1'),
 ('select avg(age) from student where stuid not in (select stuid from has_pet)',
  'pets_1'),
 ('SELECT count(*) FROM CONTINENTS;', 'car_1'),
 ('SELECT count(*) FROM CONTINENTS;', 'car_1'),
 ('SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;',
  'car_1'),
 ('SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;',
  'car_1'),
 ('SELECT count(*) FROM COUNTRIES;', 'car_1'),
 ('SELECT count(*) FROM COUNTRIES;', 'car_1'),
 ('SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;',
  'car_1'),
 ('SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;',
  'car_1'),
 ('SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;',
  'car_1'),
 ('SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;',
  'car_1'),
 ('SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)',
  'car_1'),
 ('SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)',
  'car_1'),
 ("SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';",
  'car_1')]

### Write to .txt files:

#### Gold

In [13]:
with open('gold.txt', 'w') as file:

    for element in y_test_query_chinook:
        file.write(element[0] + '\t' + element[1] + '\n')

#### Predictions

In [14]:
# with open('pred.txt', 'w') as file:

#     # for element in :
#     #     file.write(element[0] + '\t' + element[1] + '\n')

### Create .db files

In [15]:
import sqlite3


def sql_to_db(sql_file, new_db_filename):
    conn = sqlite3.connect('/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/spider/db_schemas/' + new_db_filename + '.db')

    # Read and execute the schema.sql file
    with open(sql_file, 'r') as f:
        conn.executescript(f.read())

    conn.commit()
    conn.close()

# sql_to_db('/Users/mymac/LLM/Personal-Medical-Assistant/backend/testing/spider/test_database/academic/schema.sql','academic_test')

In [16]:
s = '/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/spider/test_database/browser_web/schema.sql'

s[84:-11]

'browser_web'

In [18]:

with open('/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/spider/sql_files.txt', 'r') as file:
    # Read each line in the file
    lines = file.readlines()
    start_int = 81
    end_int = -12
    
    for line in lines:

        # try:

            line = line.strip()
            new_filename = line[84:-11]              #naively index into the name of the database given absolute path
            sql_to_db(line,new_db_filename=new_filename)

        # except:
        #     print(f"error occurred: {new_filename}")

OperationalError: unable to open database file

In [23]:
def get_schema(_):
    return DB.get_table_info()

In [24]:
directory_path = '/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/spider/db_schemas'
schemas = []
count = 0
# Walk through the directory
for root, dirs, files in os.walk(directory_path):
    for file in files:
        count += 1

        try:
            DB = SQLDatabase.from_uri("sqlite:///" + directory_path + '/' + file)
            schemas.append(get_schema(''))

        except:
            print("Error occurred: " + file)

/Users/mymac/opt/anaconda3/envs/LLM/lib/python3.9/site-packages/langchain_community/utilities/sql_database.py:122: SAWarning: Could not instantiate type <class 'sqlalchemy.sql.sqltypes.INTEGER'> with reflected arguments ['11']; using no arguments.
  self._metadata.reflect(
/Users/mymac/opt/anaconda3/envs/LLM/lib/python3.9/site-packages/langchain_community/utilities/sql_database.py:122: SAWarning: WARNING: SQL-parsed foreign key constraint '('Event_ID', 'Events', 'Event_ID')' could not be located in PRAGMA foreign_keys for table Assets_in_Events
  self._metadata.reflect(

Error occurred: store_product.db
Error occurred: book_1.db
Error occurred: flight_1.db
Error occurred: music_1.db

In [26]:
len(schemas)

37

In [ ]:
directory_path = '/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/spider/test_database'

# Output file to write the paths
output_file = '/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/spider/sql_files.txt'

with open(output_file, 'w') as outfile:
    for root, dirs, files in os.walk(directory_path):
        # List subdirectories directly within the current directory
        if root == os.path.join(directory_path):
            for directory in dirs:
                print("DIR", directory)

                directory_files = os.listdir(os.path.join(directory_path, directory))
                print("__Files in", directory)
                for file in directory_files:
                    if file.endswith('.sql'):
                        file_path = os.path.join(root, directory, file)
                        print(file)
                        outfile.write(file_path + '\n')

DIR browser_web
__Files in browser_web
schema.sql
DIR musical
__Files in musical
schema.sql
DIR country_language
__Files in country_language
schema.sql
DIR farm
__Files in farm
schema.sql
DIR voter_1
__Files in voter_1
DIR game_injury
__Files in game_injury
schema.sql
DIR hospital_1
__Files in hospital_1
schema.sql
DIR manufacturer
__Files in manufacturer
schema.sql
DIR station_weather
__Files in station_weather
schema.sql
DIR perpetrator
__Files in perpetrator
schema.sql
DIR soccer_3
__Files in soccer_3
schema.sql
DIR storm_record
__Files in storm_record
schema.sql
DIR flight_1
__Files in flight_1
schema.sql
DIR manufactory_1
__Files in manufactory_1
schema.sql
DIR cre_Theme_park
__Files in cre_Theme_park
schema.sql
DIR museum_visit
__Files in museum_visit
schema.sql
DIR race_track
__Files in race_track
schema.sql
DIR soccer_2
__Files in soccer_2
schema.sql
DIR bike_1
__Files in bike_1
schema.sql
DIR bbc_channels
__Files in bbc_channels
schema.sql
DIR pilot_record
__Files in pilot_record
schema.sql
DIR customers_and_invoices
__Files in customers_and_invoices
schema.sql
DIR boat_1
__Files in boat_1
schema.sql
DIR department_management
__Files in department_management
schema.sql
DIR news_report
__Files in news_report
schema.sql
DIR cre_Doc_and_collections
__Files in cre_Doc_and_collections
schema.sql
DIR government_shift
__Files in government_shift
schema.sql
DIR tvshow
__Files in tvshow
schema.sql
DIR music_1
__Files in music_1
schema.sql
DIR store_product
__Files in store_product
schema.sql
DIR region_building
__Files in region_building
schema.sql
DIR party_host
__Files in party_host
schema.sql
DIR ship_1
__Files in ship_1
schema.sql
DIR solvency_ii
__Files in solvency_ii
schema.sql
DIR products_gen_characteristics
__Files in products_gen_characteristics
schema.sql
DIR dog_kennels
__Files in dog_kennels
schema.sql
DIR local_govt_and_lot
__Files in local_govt_and_lot
schema.sql
DIR conference
__Files in conference
schema.sql
DIR video_game
__Files in video_game
schema.sql
DIR culture_company
__Files in culture_company
schema.sql
DIR aircraft
__Files in aircraft
schema.sql
DIR book_1
__Files in book_1
schema.sql
schema_old.sql
DIR wta_1
__Files in wta_1
wta_1.sql
DIR cinema
__Files in cinema
schema.sql
DIR e_commerce
__Files in e_commerce
schema.sql
DIR formula_1
__Files in formula_1
formula_1.sql
DIR wine_1
__Files in wine_1
wine_1.sql
DIR gas_company
__Files in gas_company
schema.sql
DIR district_spokesman
__Files in district_spokesman
schema.sql
DIR customers_and_orders
__Files in customers_and_orders
schema.sql
DIR network_2
__Files in network_2
schema.sql
DIR match_season
__Files in match_season
schema.sql
DIR phone_1
__Files in phone_1
schema.sql
DIR car_road_race
__Files in car_road_race
schema.sql
DIR pets_1
__Files in pets_1
schema.sql
DIR tracking_grants_for_research
__Files in tracking_grants_for_research
schema.sql
DIR party_people
__Files in party_people
schema.sql
DIR hr_1
__Files in hr_1
schema.sql
DIR pilot_1
__Files in pilot_1
schema.sql
DIR scientist_1
__Files in scientist_1
schema.sql
DIR college_3
__Files in college_3
schema.sql
DIR cre_Doc_Template_Mgt
__Files in cre_Doc_Template_Mgt
schema.sql
DIR restaurants
__Files in restaurants
schema.sql
DIR program_share
__Files in program_share
schema.sql
DIR advertising_agencies
__Files in advertising_agencies
schema.sql
DIR college_2
__Files in college_2
TextBookExampleSchema.sql
DIR course_teach
__Files in course_teach
schema.sql
DIR candidate_poll
__Files in candidate_poll
schema.sql
DIR cre_Doc_Control_Systems
__Files in cre_Doc_Control_Systems
schema.sql
DIR wedding
__Files in wedding
schema.sql
DIR cre_Doc_Workflow
__Files in cre_Doc_Workflow
schema.sql
DIR car_racing
__Files in car_racing
schema.sql
DIR yelp
__Files in yelp
schema.sql
DIR document_management
__Files in document_management
schema.sql
DIR aan_1
__Files in aan_1
schema.sql
DIR loan_1
__Files in loan_1
schema.sql
DIR railway
__Files in railway
schema.sql
DIR geo
__Files in geo
schema.sql
DIR restaurant_bills
__Files in restaurant_bills
schema.sql
schema_old.sql
DIR sakila_1
__Files in sakila_1
schema.sql
DIR headphone_store
__Files in headphone_store
schema.sql
DIR movie_1
__Files in movie_1
schema.sql
DIR flight_company
__Files in flight_company
schema.sql
DIR csu_1
__Files in csu_1
schema.sql
DIR company_employee
__Files in company_employee
schema.sql
DIR orchestra
__Files in orchestra
schema.sql
DIR car_1
__Files in car_1
car_1.sql
DIR vehicle_driver
__Files in vehicle_driver
schema.sql
DIR address_1
__Files in address_1
schema.sql
DIR customers_card_transactions
__Files in customers_card_transactions
schema.sql
DIR machine_repair
__Files in machine_repair
schema.sql
DIR real_estate_rentals
__Files in real_estate_rentals
schema.sql
DIR shop_membership
__Files in shop_membership
schema.sql
DIR wrestler
__Files in wrestler
schema.sql
DIR performance_attendance
__Files in performance_attendance
schema.sql
DIR debate
__Files in debate
schema.sql
DIR icfp_1
__Files in icfp_1
DIR e_learning
__Files in e_learning
schema.sql
DIR customer_deliveries
__Files in customer_deliveries
schema.sql
DIR academic
__Files in academic
schema.sql
DIR cre_Doc_Tracking_DB
__Files in cre_Doc_Tracking_DB
schema.sql
DIR club_leader
__Files in club_leader
schema.sql
schema_old.sql
DIR art_1
__Files in art_1
DIR cre_Students_Information_Systems
__Files in cre_Students_Information_Systems
schema.sql
DIR entertainment_awards
__Files in entertainment_awards
schema.sql
DIR department_store
__Files in department_store
schema.sql
DIR customers_and_products_contacts
__Files in customers_and_products_contacts
schema.sql
DIR vehicle_rent
__Files in vehicle_rent
schema.sql
DIR voter_2
__Files in voter_2
schema.sql
DIR bakery_1
__Files in bakery_1
bakery_1.sql
DIR driving_school
__Files in driving_school
schema.sql
DIR school_finance
__Files in school_finance
schema.sql
DIR roller_coaster
__Files in roller_coaster
schema.sql
DIR journal_committee
__Files in journal_committee
schema.sql
DIR flight_4
__Files in flight_4
DIR club_1
__Files in club_1
schema.sql
DIR epinions_1
__Files in epinions_1
DIR decoration_competition
__Files in decoration_competition
schema.sql
DIR warehouse_1
__Files in warehouse_1
schema.sql
DIR architecture
__Files in architecture
schema.sql
DIR train_station
__Files in train_station
schema.sql
DIR allergy_1
__Files in allergy_1
schema.sql
DIR soccer_1
__Files in soccer_1
schema.sql
DIR institution_sports
__Files in institution_sports
schema.sql
schema_old.sql
DIR election_representative
__Files in election_representative
schema.sql
DIR city_record
__Files in city_record
schema.sql
DIR customers_campaigns_ecommerce
__Files in customers_campaigns_ecommerce
schema.sql
DIR flight_2
__Files in flight_2
flight_2.sql
DIR poker_player
__Files in poker_player
schema.sql
DIR customer_complaints
__Files in customer_complaints
schema.sql
DIR company_1
__Files in company_1
DIR concert_singer
__Files in concert_singer
schema.sql
DIR bike_racing
__Files in bike_racing
schema.sql
schema_old.sql
DIR tv_shows
__Files in tv_shows
schema.sql
DIR cre_Docs_and_Epenses
__Files in cre_Docs_and_Epenses
schema.sql
DIR insurance_and_eClaims
__Files in insurance_and_eClaims
schema.sql
DIR insurance_policies
__Files in insurance_policies
schema.sql
DIR county_public_safety
__Files in county_public_safety
schema.sql
DIR baseball_1
__Files in baseball_1
schema.sql
DIR imdb
__Files in imdb
schema.sql
DIR music_2
__Files in music_2
schema.sql
DIR network_1
__Files in network_1
schema.sql
DIR climbing
__Files in climbing
schema.sql
DIR swimming
__Files in swimming
schema.sql
DIR customers_and_addresses
__Files in customers_and_addresses
schema.sql
DIR tracking_share_transactions
__Files in tracking_share_transactions
schema.sql
DIR game_1
__Files in game_1
schema.sql
DIR cre_Drama_Workshop_Groups
__Files in cre_Drama_Workshop_Groups
schema.sql
DIR election
__Files in election
schema.sql
DIR book_2
__Files in book_2
schema.sql
DIR music_4
__Files in music_4
schema.sql
DIR small_bank_1
__Files in small_bank_1
DIR local_govt_in_alabama
__Files in local_govt_in_alabama
schema.sql
DIR device
__Files in device
schema.sql
DIR sports_competition
__Files in sports_competition
schema.sql
DIR workshop_paper
__Files in workshop_paper
schema.sql
DIR tracking_orders
__Files in tracking_orders
schema.sql
DIR school_bus
__Files in school_bus
schema.sql
DIR protein_institute
__Files in protein_institute
schema.sql
DIR activity_1
__Files in activity_1
schema.sql
DIR phone_market
__Files in phone_market
schema.sql
DIR entrepreneur
__Files in entrepreneur
schema.sql
DIR apartment_rentals
__Files in apartment_rentals
schema.sql
DIR medicine_enzyme_interaction
__Files in medicine_enzyme_interaction
schema.sql
DIR gymnast
__Files in gymnast
schema.sql
DIR student_1
__Files in student_1
student_1.sql
DIR store_1
__Files in store_1
schema.sql
DIR planet_1
__Files in planet_1
schema.sql
DIR employee_hire_evaluation
__Files in employee_hire_evaluation
schema.sql
DIR college_1
__Files in college_1
TinyCollege.sql
DIR local_govt_mdm
__Files in local_govt_mdm
schema.sql
DIR company_office
__Files in company_office
schema.sql
DIR battle_death
__Files in battle_death
schema.sql
DIR dorm_1
__Files in dorm_1
schema.sql
DIR products_for_hire
__Files in products_for_hire
schema.sql
DIR movie_2
__Files in movie_2
schema.sql
DIR coffee_shop
__Files in coffee_shop
schema.sql
DIR singer
__Files in singer
schema.sql
DIR chinook_1
__Files in chinook_1
DIR behavior_monitoring
__Files in behavior_monitoring
schema.sql
DIR world_1
__Files in world_1
DIR sing_contest
__Files in sing_contest
schema.sql
schema_old.sql
DIR university_basketball
__Files in university_basketball
schema.sql
DIR mountain_photos
__Files in mountain_photos
schema.sql
DIR scholar
__Files in scholar
schema.sql
DIR product_catalog
__Files in product_catalog
schema.sql
DIR real_estate_properties
__Files in real_estate_properties
schema.sql
DIR student_transcripts_tracking
__Files in student_transcripts_tracking
schema.sql
DIR book_review
__Files in book_review
schema.sql
schema_old.sql
DIR film_rank
__Files in film_rank
schema.sql
DIR theme_gallery
__Files in theme_gallery
schema.sql
DIR online_exams
__Files in online_exams
schema.sql
simple_schema.sql
DIR university_rank
__Files in university_rank
schema.sql
DIR book_press
__Files in book_press
schema.sql
DIR e_government
__Files in e_government
schema.sql
DIR insurance_fnol
__Files in insurance_fnol
schema.sql
DIR restaurant_1
__Files in restaurant_1
schema.sql
DIR inn_1
__Files in inn_1
inn_1.sql
DIR tracking_software_problems
__Files in tracking_software_problems
schema.sql
DIR riding_club
__Files in riding_club
schema.sql
DIR ship_mission
__Files in ship_mission
schema.sql
DIR student_assessment
__Files in student_assessment
schema.sql
DIR assets_maintenance
__Files in assets_maintenance
schema.sql
DIR twitter_1
__Files in twitter_1
DIR body_builder
__Files in body_builder
schema.sql
DIR school_player
__Files in school_player
schema.sql

In [ ]:
# Iterate over all files in the directory
import os

directory_path = '/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/spider/test_database'

paths = []

for root, dirs, files in os.walk(directory_path):
    if root == os.path.join(directory_path):
        # print("Subdirectories directly within the current directory:")
        for directory in dirs:
            print("DIR",directory)

            directory_files = os.listdir(os.path.join(directory_path, directory))
            print("__Files in", directory)
            for file in directory_files:
                # print(file)
                # try:

                if file.endswith('.sql'):
                    print(file)


                    
                #     new_filename = file[:-4]
                #     sql_to_db(file, directory)


with open('sql_files.txt', 'w') as file:

    for p in paths:
        file.write('/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/executable' + )

DIR browser_web
__Files in browser_web
schema.sql
DIR musical
__Files in musical
schema.sql
DIR country_language
__Files in country_language
schema.sql
DIR farm
__Files in farm
schema.sql
DIR voter_1
__Files in voter_1
DIR game_injury
__Files in game_injury
schema.sql
DIR hospital_1
__Files in hospital_1
schema.sql
DIR manufacturer
__Files in manufacturer
schema.sql
DIR station_weather
__Files in station_weather
schema.sql
DIR perpetrator
__Files in perpetrator
schema.sql
DIR soccer_3
__Files in soccer_3
schema.sql
DIR storm_record
__Files in storm_record
schema.sql
DIR flight_1
__Files in flight_1
schema.sql
DIR manufactory_1
__Files in manufactory_1
schema.sql
DIR cre_Theme_park
__Files in cre_Theme_park
schema.sql
DIR museum_visit
__Files in museum_visit
schema.sql
DIR race_track
__Files in race_track
schema.sql
DIR soccer_2
__Files in soccer_2
schema.sql
DIR bike_1
__Files in bike_1
schema.sql
DIR bbc_channels
__Files in bbc_channels
schema.sql
DIR pilot_record
__Files in pilot_record
schema.sql
DIR customers_and_invoices
__Files in customers_and_invoices
schema.sql
DIR boat_1
__Files in boat_1
schema.sql
DIR department_management
__Files in department_management
schema.sql
DIR news_report
__Files in news_report
schema.sql
DIR cre_Doc_and_collections
__Files in cre_Doc_and_collections
schema.sql
DIR government_shift
__Files in government_shift
schema.sql
DIR tvshow
__Files in tvshow
schema.sql
DIR music_1
__Files in music_1
schema.sql
DIR store_product
__Files in store_product
schema.sql
DIR region_building
__Files in region_building
schema.sql
DIR party_host
__Files in party_host
schema.sql
DIR ship_1
__Files in ship_1
schema.sql
DIR solvency_ii
__Files in solvency_ii
schema.sql
DIR products_gen_characteristics
__Files in products_gen_characteristics
schema.sql
DIR dog_kennels
__Files in dog_kennels
schema.sql
DIR local_govt_and_lot
__Files in local_govt_and_lot
schema.sql
DIR conference
__Files in conference
schema.sql
DIR video_game
__Files in video_game
schema.sql
DIR culture_company
__Files in culture_company
schema.sql
DIR aircraft
__Files in aircraft
schema.sql
DIR book_1
__Files in book_1
schema.sql
schema_old.sql
DIR wta_1
__Files in wta_1
wta_1.sql
DIR cinema
__Files in cinema
schema.sql
DIR e_commerce
__Files in e_commerce
schema.sql
DIR formula_1
__Files in formula_1
formula_1.sql
DIR wine_1
__Files in wine_1
wine_1.sql
DIR gas_company
__Files in gas_company
schema.sql
DIR district_spokesman
__Files in district_spokesman
schema.sql
DIR customers_and_orders
__Files in customers_and_orders
schema.sql
DIR network_2
__Files in network_2
schema.sql
DIR match_season
__Files in match_season
schema.sql
DIR phone_1
__Files in phone_1
schema.sql
DIR car_road_race
__Files in car_road_race
schema.sql
DIR pets_1
__Files in pets_1
schema.sql
DIR tracking_grants_for_research
__Files in tracking_grants_for_research
schema.sql
DIR party_people
__Files in party_people
schema.sql
DIR hr_1
__Files in hr_1
schema.sql
DIR pilot_1
__Files in pilot_1
schema.sql
DIR scientist_1
__Files in scientist_1
schema.sql
DIR college_3
__Files in college_3
schema.sql
DIR cre_Doc_Template_Mgt
__Files in cre_Doc_Template_Mgt
schema.sql
DIR restaurants
__Files in restaurants
schema.sql
DIR program_share
__Files in program_share
schema.sql
DIR advertising_agencies
__Files in advertising_agencies
schema.sql
DIR college_2
__Files in college_2
TextBookExampleSchema.sql
DIR course_teach
__Files in course_teach
schema.sql
DIR candidate_poll
__Files in candidate_poll
schema.sql
DIR cre_Doc_Control_Systems
__Files in cre_Doc_Control_Systems
schema.sql
DIR wedding
__Files in wedding
schema.sql
DIR cre_Doc_Workflow
__Files in cre_Doc_Workflow
schema.sql
DIR car_racing
__Files in car_racing
schema.sql
DIR yelp
__Files in yelp
schema.sql
DIR document_management
__Files in document_management
schema.sql
DIR aan_1
__Files in aan_1
schema.sql
DIR loan_1
__Files in loan_1
schema.sql
DIR railway
__Files in railway
schema.sql
DIR geo
__Files in geo
schema.sql
DIR restaurant_bills
__Files in restaurant_bills
schema.sql
schema_old.sql
DIR sakila_1
__Files in sakila_1
schema.sql
DIR headphone_store
__Files in headphone_store
schema.sql
DIR movie_1
__Files in movie_1
schema.sql
DIR flight_company
__Files in flight_company
schema.sql
DIR csu_1
__Files in csu_1
schema.sql
DIR company_employee
__Files in company_employee
schema.sql
DIR orchestra
__Files in orchestra
schema.sql
DIR car_1
__Files in car_1
car_1.sql
DIR vehicle_driver
__Files in vehicle_driver
schema.sql
DIR address_1
__Files in address_1
schema.sql
DIR customers_card_transactions
__Files in customers_card_transactions
schema.sql
DIR machine_repair
__Files in machine_repair
schema.sql
DIR real_estate_rentals
__Files in real_estate_rentals
schema.sql
DIR shop_membership
__Files in shop_membership
schema.sql
DIR wrestler
__Files in wrestler
schema.sql
DIR performance_attendance
__Files in performance_attendance
schema.sql
DIR debate
__Files in debate
schema.sql
DIR icfp_1
__Files in icfp_1
DIR e_learning
__Files in e_learning
schema.sql
DIR customer_deliveries
__Files in customer_deliveries
schema.sql
DIR academic
__Files in academic
schema.sql
DIR cre_Doc_Tracking_DB
__Files in cre_Doc_Tracking_DB
schema.sql
DIR club_leader
__Files in club_leader
schema.sql
schema_old.sql
DIR art_1
__Files in art_1
DIR cre_Students_Information_Systems
__Files in cre_Students_Information_Systems
schema.sql
DIR entertainment_awards
__Files in entertainment_awards
schema.sql
DIR department_store
__Files in department_store
schema.sql
DIR customers_and_products_contacts
__Files in customers_and_products_contacts
schema.sql
DIR vehicle_rent
__Files in vehicle_rent
schema.sql
DIR voter_2
__Files in voter_2
schema.sql
DIR bakery_1
__Files in bakery_1
bakery_1.sql
DIR driving_school
__Files in driving_school
schema.sql
DIR school_finance
__Files in school_finance
schema.sql
DIR roller_coaster
__Files in roller_coaster
schema.sql
DIR journal_committee
__Files in journal_committee
schema.sql
DIR flight_4
__Files in flight_4
DIR club_1
__Files in club_1
schema.sql
DIR epinions_1
__Files in epinions_1
DIR decoration_competition
__Files in decoration_competition
schema.sql
DIR warehouse_1
__Files in warehouse_1
schema.sql
DIR architecture
__Files in architecture
schema.sql
DIR train_station
__Files in train_station
schema.sql
DIR allergy_1
__Files in allergy_1
schema.sql
DIR soccer_1
__Files in soccer_1
schema.sql
DIR institution_sports
__Files in institution_sports
schema.sql
schema_old.sql
DIR election_representative
__Files in election_representative
schema.sql
DIR city_record
__Files in city_record
schema.sql
DIR customers_campaigns_ecommerce
__Files in customers_campaigns_ecommerce
schema.sql
DIR flight_2
__Files in flight_2
flight_2.sql
DIR poker_player
__Files in poker_player
schema.sql
DIR customer_complaints
__Files in customer_complaints
schema.sql
DIR company_1
__Files in company_1
DIR concert_singer
__Files in concert_singer
schema.sql
DIR bike_racing
__Files in bike_racing
schema.sql
schema_old.sql
DIR tv_shows
__Files in tv_shows
schema.sql
DIR cre_Docs_and_Epenses
__Files in cre_Docs_and_Epenses
schema.sql
DIR insurance_and_eClaims
__Files in insurance_and_eClaims
schema.sql
DIR insurance_policies
__Files in insurance_policies
schema.sql
DIR county_public_safety
__Files in county_public_safety
schema.sql
DIR baseball_1
__Files in baseball_1
schema.sql
DIR imdb
__Files in imdb
schema.sql
DIR music_2
__Files in music_2
schema.sql
DIR network_1
__Files in network_1
schema.sql
DIR climbing
__Files in climbing
schema.sql
DIR swimming
__Files in swimming
schema.sql
DIR customers_and_addresses
__Files in customers_and_addresses
schema.sql
DIR tracking_share_transactions
__Files in tracking_share_transactions
schema.sql
DIR game_1
__Files in game_1
schema.sql
DIR cre_Drama_Workshop_Groups
__Files in cre_Drama_Workshop_Groups
schema.sql
DIR election
__Files in election
schema.sql
DIR book_2
__Files in book_2
schema.sql
DIR music_4
__Files in music_4
schema.sql
DIR small_bank_1
__Files in small_bank_1
DIR local_govt_in_alabama
__Files in local_govt_in_alabama
schema.sql
DIR device
__Files in device
schema.sql
DIR sports_competition
__Files in sports_competition
schema.sql
DIR workshop_paper
__Files in workshop_paper
schema.sql
DIR tracking_orders
__Files in tracking_orders
schema.sql
DIR school_bus
__Files in school_bus
schema.sql
DIR protein_institute
__Files in protein_institute
schema.sql
DIR activity_1
__Files in activity_1
schema.sql
DIR phone_market
__Files in phone_market
schema.sql
DIR entrepreneur
__Files in entrepreneur
schema.sql
DIR apartment_rentals
__Files in apartment_rentals
schema.sql
DIR medicine_enzyme_interaction
__Files in medicine_enzyme_interaction
schema.sql
DIR gymnast
__Files in gymnast
schema.sql
DIR student_1
__Files in student_1
student_1.sql
DIR store_1
__Files in store_1
schema.sql
DIR planet_1
__Files in planet_1
schema.sql
DIR employee_hire_evaluation
__Files in employee_hire_evaluation
schema.sql
DIR college_1
__Files in college_1
TinyCollege.sql
DIR local_govt_mdm
__Files in local_govt_mdm
schema.sql
DIR company_office
__Files in company_office
schema.sql
DIR battle_death
__Files in battle_death
schema.sql
DIR dorm_1
__Files in dorm_1
schema.sql
DIR products_for_hire
__Files in products_for_hire
schema.sql
DIR movie_2
__Files in movie_2
schema.sql
DIR coffee_shop
__Files in coffee_shop
schema.sql
DIR singer
__Files in singer
schema.sql
DIR chinook_1
__Files in chinook_1
DIR behavior_monitoring
__Files in behavior_monitoring
schema.sql
DIR world_1
__Files in world_1
DIR sing_contest
__Files in sing_contest
schema.sql
schema_old.sql
DIR university_basketball
__Files in university_basketball
schema.sql
DIR mountain_photos
__Files in mountain_photos
schema.sql
DIR scholar
__Files in scholar
schema.sql
DIR product_catalog
__Files in product_catalog
schema.sql
DIR real_estate_properties
__Files in real_estate_properties
schema.sql
DIR student_transcripts_tracking
__Files in student_transcripts_tracking
schema.sql
DIR book_review
__Files in book_review
schema.sql
schema_old.sql
DIR film_rank
__Files in film_rank
schema.sql
DIR theme_gallery
__Files in theme_gallery
schema.sql
DIR online_exams
__Files in online_exams
schema.sql
simple_schema.sql
DIR university_rank
__Files in university_rank
schema.sql
DIR book_press
__Files in book_press
schema.sql
DIR e_government
__Files in e_government
schema.sql
DIR insurance_fnol
__Files in insurance_fnol
schema.sql
DIR restaurant_1
__Files in restaurant_1
schema.sql
DIR inn_1
__Files in inn_1
inn_1.sql
DIR tracking_software_problems
__Files in tracking_software_problems
schema.sql
DIR riding_club
__Files in riding_club
schema.sql
DIR ship_mission
__Files in ship_mission
schema.sql
DIR student_assessment
__Files in student_assessment
schema.sql
DIR assets_maintenance
__Files in assets_maintenance
schema.sql
DIR twitter_1
__Files in twitter_1
DIR body_builder
__Files in body_builder
schema.sql
DIR school_player
__Files in school_player
schema.sql

In [ ]:
df_train

,db_id,query,question,query_toks,query_toks_no_value,question_toks
0,department_management,SELECT count(*) FROM head WHERE age > 56,How many heads of the departments are older th...,"[SELECT, count, (, *, ), FROM, head, WHERE, ag...","[select, count, (, *, ), from, head, where, ag...","[How, many, heads, of, the, departments, are, ..."
1,department_management,"SELECT name , born_state , age FROM head ORD...","List the name, born state and age of the heads...","[SELECT, name, ,, born_state, ,, age, FROM, he...","[select, name, ,, born_state, ,, age, from, he...","[List, the, name, ,, born, state, and, age, of..."
2,department_management,"SELECT creation , name , budget_in_billions ...","List the creation year, name and budget of eac...","[SELECT, creation, ,, name, ,, budget_in_billi...","[select, creation, ,, name, ,, budget_in_billi...","[List, the, creation, year, ,, name, and, budg..."
3,department_management,"SELECT max(budget_in_billions) , min(budget_i...",What are the maximum and minimum budget of the...,"[SELECT, max, (, budget_in_billions, ), ,, min...","[select, max, (, budget_in_billions, ), ,, min...","[What, are, the, maximum, and, minimum, budget..."
4,department_management,SELECT avg(num_employees) FROM department WHER...,What is the average number of employees of the...,"[SELECT, avg, (, num_employees, ), FROM, depar...","[select, avg, (, num_employees, ), from, depar...","[What, is, the, average, number, of, employees..."
...,...,...,...,...,...,...
6995,culture_company,SELECT T1.company_name FROM culture_company AS...,What are all the company names that have a boo...,"[SELECT, T1.company_name, FROM, culture_compan...","[select, t1, ., company_name, from, culture_co...","[What, are, all, the, company, names, that, ha..."
6996,culture_company,"SELECT T1.title , T3.book_title FROM movie AS...",Show the movie titles and book titles for all ...,"[SELECT, T1.title, ,, T3.book_title, FROM, mov...","[select, t1, ., title, ,, t3, ., book_title, f...","[Show, the, movie, titles, and, book, titles, ..."
6997,culture_company,"SELECT T1.title , T3.book_title FROM movie AS...",What are the titles of movies and books corres...,"[SELECT, T1.title, ,, T3.book_title, FROM, mov...","[select, t1, ., title, ,, t3, ., book_title, f...","[What, are, the, titles, of, movies, and, book..."
6998,culture_company,SELECT T2.company_name FROM movie AS T1 JOIN c...,Show all company names with a movie directed i...,"[SELECT, T2.company_name, FROM, movie, AS, T1,...","[select, t2, ., company_name, from, movie, as,...","[Show, all, company, names, with, a, movie, di..."
6999,culture_company,SELECT T2.company_name FROM movie AS T1 JOIN c...,What are all company names that have a corresp...,"[SELECT, T2.company_name, FROM, movie, AS, T1,...","[select, t2, ., company_name, from, movie, as,...","[What, are, all, company, names, that, have, a..."

In [1]:
from langchain_community.llms import Ollama

LLM = Ollama(model="phi3")      #choose LLM

Ollama
Params: {'model': 'phi3',